tiborsimon/embedded-tdd-headers/pic/pic18/pic18f87j90_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F87J90_H_
#define _PIC18F87J90_H_

#define PADCFG1                       0
#define RTSECSEL0                     1
#define RTSECSEL1                     2
#define CTMUICON                      3
#define IRNG                          4
#define IRNG0                         5
#define IRNG1                         6
#define ITRIM0                        7
#define ITRIM                         8
#define ITRIM1                        9
#define ITRIM2                        10
#define ITRIM3                        11
#define ITRIM4                        12
#define ITRIM5                        13
#define CTMUCONL                      14
#define EDG1STAT                      15
#define EDG2STAT                      16
#define EDG1SEL0                      17
#define EDG1SEL1                      18
#define EDG1POL                       19
#define EDG2SEL0                      20
#define EDG2SEL1                      21
#define EDG2POL                       22
#define CTMUCONH                      23
#define CTTRIG                        24
#define IDISSEN                       25
#define EDGSEQEN                      26
#define EDGEN                         27
#define TGEN                          28
#define CTMUSIDL                      29
#define CTMUEN                        30
#define ALRMVALL                      31
#define ALRMVALH                      32
#define ALRMRPT                       33
#define ARPT0                         34
#define ARPT                          35
#define ARPT1                         36
#define ARPT2                         37
#define ARPT3                         38
#define ARPT4                         39
#define ARPT5                         40
#define ARPT6                         41
#define ARPT7                         42
#define ALRMCFG                       43
#define ALRMPTR                       44
#define ALRMPTR0                      45
#define ALRMPTR1                      46
#define AMASK0                        47
#define AMASK                         48
#define AMASK1                        49
#define AMASK2                        50
#define AMASK3                        51
#define CHIME                         52
#define ALRMEN                        53
#define RTCVALL                       54
#define WAITE0                        55
#define RTCVALH                       56
#define WAITE1                        57
#define WAITM0                        58
#define WAITM1                        59
#define WAITM2                        60
#define WAITM3                        61
#define WAITB0                        62
#define WAITB1                        63
#define RTCCAL                        64
#define CAL0                          65
#define CAL                           66
#define CAL1                          67
#define CAL2                          68
#define CAL3                          69
#define CAL4                          70
#define CAL5                          71
#define CAL6                          72
#define CAL7                          73
#define RTCCFG                        74
#define RTCPTR0                       75
#define RTCPTR1                       76
#define RTCOE                         77
#define HALFSEC                       78
#define RTCSYNC                       79
#define RTCWREN                       80
#define RTCEN                         81
#define RCSTA2                        82
#define RCD82                         83
#define RX9D2                         84
#define RCSTA2_RCD8                   85
#define RCSTA2_RX9D                   86
#define RCSTA2_OERR                   87
#define OERR2                         88
#define FERR2                         89
#define RCSTA2_FERR                   90
#define ADDEN2                        91
#define RCSTA2_ADDEN                  92
#define RCSTA2_CREN                   93
#define CREN2                         94
#define SREN2                         95
#define RCSTA2_SREN                   96
#define RC92                          97
#define RC8_92                        98
#define RCSTA2_RX9                    99
#define RCSTA2_NOT_RC8                100
#define RCSTA2_RC9                    101
#define RCSTA2_RC8_9                  102
#define RX92                          103
#define RCSTA2_SPEN                   104
#define SPEN2                         105
#define TXSTA2                        106
#define TXSTA2_TXD8                   107
#define TX9D2                         108
#define TXSTA2_TX9D                   109
#define TXD82                         110
#define TRMT2                         111
#define TXSTA2_TRMT                   112
#define BRGH2                         113
#define TXSTA2_BRGH                   114
#define SENDB2                        115
#define TXSTA2_SYNC                   116
#define SYNC2                         117
#define TXEN2                         118
#define TXSTA2_TXEN                   119
#define TX8_92                        120
#define TX92                          121
#define TXSTA2_TX9                    122
#define TXSTA2_NOT_TX8                123
#define TXSTA2_TX8_9                  124
#define TXSTA2_CSRC                   125
#define CSRC2                         126
#define TXREG2                        127
#define RCREG2                        128
#define SPBRG2                        129
#define CCP2CON                       130
#define CCP2M                         131
#define CCP2M0                        132
#define CCP2M1                        133
#define CCP2M2                        134
#define CCP2M3                        135
#define DC2B0                         136
#define DCCP2Y                        137
#define DC2B                          138
#define DC2B1                         139
#define DCCP2X                        140
#define CCPR2L                        141
#define CCPR2H                        142
#define CCP1CON                       143
#define CCP1M0                        144
#define CCP1M                         145
#define CCP1M1                        146
#define CCP1M2                        147
#define CCP1M3                        148
#define DCCP1Y                        149
#define DC1B                          150
#define DC1B0                         151
#define DCCP1X                        152
#define DC1B1                         153
#define CCPR1L                        154
#define CCPR1H                        155
#define LCDDATA5                      156
#define S40C0                         157
#define SEG40COM0                     158
#define S40C15                        159
#define SEG41COM0                     160
#define S41C0                         161
#define S42C0                         162
#define SEG42COM0                     163
#define S43C0                         164
#define SEG43COM0                     165
#define SEG44COM0                     166
#define S44C0                         167
#define S45C0                         168
#define SEG45COM0                     169
#define S46C0                         170
#define SEG46COM0                     171
#define S47C0                         172
#define SEG47COM0                     173
#define SEG0COM1                      174
#define LCDDATA6                      175
#define S00C1                         176
#define S0C1                          177
#define S01C1                         178
#define SEG1COM1                      179
#define S1C1                          180
#define S02C1                         181
#define S2C1                          182
#define SEG2COM1                      183
#define S03C1                         184
#define SEG3COM1                      185
#define S3C1                          186
#define SEG4COM1                      187
#define S4C1                          188
#define S04C1                         189
#define S5C1                          190
#define S05C1                         191
#define SEG5COM1                      192
#define SEG6COM1                      193
#define S6C1                          194
#define S06C1                         195
#define SEG7COM1                      196
#define S7C1                          197
#define S07C1                         198
#define LCDDATA7                      199
#define S08C1                         200
#define S8C1                          201
#define SEG8COM1                      202
#define SEG9COM1                      203
#define S09C1                         204
#define S9C1                          205
#define S10C1                         206
#define SEG10COM1                     207
#define S11C1                         208
#define SEG11COM1                     209
#define S12C1                         210
#define SEG12COM1                     211
#define S13C1                         212
#define SEG13COM1                     213
#define S14C1                         214
#define SEG14COM1                     215
#define SEG15COM1                     216
#define S15C1                         217
#define SEG16COM1                     218
#define LCDDATA8                      219
#define S16C1                         220
#define SEG17COM1                     221
#define S17C1                         222
#define SEG18COM1                     223
#define S18C1                         224
#define S19C1                         225
#define SEG19COM1                     226
#define S20C1                         227
#define SEG20COM1                     228
#define S21C1                         229
#define SEG21COM1                     230
#define SEG22COM1                     231
#define S22C1                         232
#define S23C1                         233
#define SEG23COM1                     234
#define S24C1                         235
#define SEG24COM1                     236
#define LCDDATA9                      237
#define S25C1                         238
#define SEG25COM1                     239
#define S26C1                         240
#define SEG26COM1                     241
#define SEG27COM1                     242
#define S27C1                         243
#define SEG28COM1                     244
#define S28C1                         245
#define SEG29COM1                     246
#define S29C1                         247
#define SEG30COM1                     248
#define S30C1                         249
#define S31C1                         250
#define SEG31COM1                     251
#define S32C1                         252
#define LCDDATA10                     253
#define SEG32COM1                     254
#define SEG33COM1                     255
#define S33C1                         256
#define S34C1                         257
#define SEG34COM1                     258
#define S35C1                         259
#define SEG35COM1                     260
#define S36C1                         261
#define SEG36COM1                     262
#define SEG37COM1                     263
#define S37C1                         264
#define S38C1                         265
#define SEG38COM1                     266
#define SEG39COM1                     267
#define S39C1                         268
#define SEG40COM1                     269
#define S40C1                         270
#define LCDDATA11                     271
#define SEG41COM1                     272
#define S41C1                         273
#define LCDDATA11_ADMSK1              274
#define SEG42COM1                     275
#define S42C1                         276
#define LCDDATA11_ADMSK2              277
#define SEG43COM1                     278
#define LCDDATA11_ADMSK3              279
#define S43C1                         280
#define SEG44COM1                     281
#define LCDDATA11_ADMSK4              282
#define S44C1                         283
#define SEG45COM1                     284
#define LCDDATA11_ADMSK5              285
#define S45C1                         286
#define S46C1                         287
#define SEG46COM1                     288
#define S47C1                         289
#define SEG47COM1                     290
#define SEG0COM2                      291
#define SSPM012                       292
#define LCDDATA12                     293
#define S00C2                         294
#define S0C2                          295
#define S01C2                         296
#define SSPM112                       297
#define SEG1COM2                      298
#define S1C2                          299
#define S02C2                         300
#define S2C2                          301
#define SEG2COM2                      302
#define SSPM212                       303
#define S03C2                         304
#define SEG3COM2                      305
#define S3C2                          306
#define SSPM312                       307
#define SEG4COM2                      308
#define S4C2                          309
#define S04C2                         310
#define S5C2                          311
#define S05C2                         312
#define SEG5COM2                      313
#define SEG6COM2                      314
#define S6C2                          315
#define S06C2                         316
#define SEG7COM2                      317
#define S7C2                          318
#define S07C2                         319
#define LCDDATA13                     320
#define S08C2                         321
#define S8C2                          322
#define SEG8COM2                      323
#define SEG9COM2                      324
#define S09C2                         325
#define S9C2                          326
#define S10C2                         327
#define SEG10COM2                     328
#define SEG11COM2                     329
#define S11C2                         330
#define S12C2                         331
#define SEG12COM2                     332
#define S13C2                         333
#define SEG13COM2                     334
#define S14C2                         335
#define SEG14COM2                     336
#define S15C2                         337
#define SEG15COM2                     338
#define SEG16COM2                     339
#define S16C2                         340
#define LCDDATA14_MSK0                341
#define LCDDATA14                     342
#define S17C2                         343
#define LCDDATA14_MSK1                344
#define SEG17COM2                     345
#define LCDDATA14_MSK2                346
#define S18C2                         347
#define SEG18COM2                     348
#define S19C2                         349
#define SEG19COM2                     350
#define LCDDATA14_MSK3                351
#define LCDDATA14_MSK4                352
#define S20C2                         353
#define SEG20COM2                     354
#define LCDDATA14_MSK5                355
#define S21C2                         356
#define SEG21COM2                     357
#define SEG22COM2                     358
#define LCDDATA14_MSK6                359
#define S22C2                         360
#define LCDDATA14_MSK7                361
#define SEG23COM2                     362
#define S23C2                         363
#define LCDDATA15                     364
#define S24C2                         365
#define SEG24COM2                     366
#define S25C2                         367
#define SEG25COM2                     368
#define S26C2                         369
#define SEG26COM2                     370
#define SEG27COM2                     371
#define S27C2                         372
#define S28C2                         373
#define SEG28COM2                     374
#define SEG29COM2                     375
#define S29C2                         376
#define SEG30COM2                     377
#define S30C2                         378
#define SEG31COM2                     379
#define S31C2                         380
#define S32C2                         381
#define LCDDATA16                     382
#define SEG32COM2                     383
#define T4CKPS016                     384
#define T4CKPS116                     385
#define SEG33COM2                     386
#define S33C2                         387
#define S34C2                         388
#define SEG34COM2                     389
#define T4OUTPS016                    390
#define S35C2                         391
#define SEG35COM2                     392
#define T4OUTPS116                    393
#define SEG36COM2                     394
#define S36C2                         395
#define T4OUTPS216                    396
#define S37C2                         397
#define SEG37COM2                     398
#define SEG38COM2                     399
#define S38C2                         400
#define T4OUTPS316                    401
#define SEG39COM2                     402
#define S39C2                         403
#define LCDDATA17                     404
#define S40C2                         405
#define SEG40COM2                     406
#define SEG41COM2                     407
#define S41C2                         408
#define S42C2                         409
#define SEG42COM2                     410
#define S43C2                         411
#define SEG43COM2                     412
#define SEG44COM2                     413
#define S44C2                         414
#define S45C2                         415
#define SEG45COM2                     416
#define S46C2                         417
#define SEG46COM2                     418
#define S47C2                         419
#define SEG47COM2                     420
#define SEG00COM3                     421
#define LCDDATA18                     422
#define S00C3                         423
#define S0C3                          424
#define S01C3                         425
#define SEG01COM3                     426
#define S1C3                          427
#define S02C3                         428
#define SEG02COM3                     429
#define S2C3                          430
#define S03C3                         431
#define S3C3                          432
#define SEG03COM3                     433
#define SEG04COM3                     434
#define S4C3                          435
#define S04C3                         436
#define S5C3                          437
#define SEG05COM3                     438
#define S05C3                         439
#define S6C3                          440
#define SEG06COM3                     441
#define S06C3                         442
#define SEG07COM3                     443
#define S7C3                          444
#define S07C3                         445
#define S8C3                          446
#define SEG8COM3                      447
#define S08C3                         448
#define LCDDATA19                     449
#define S9C3                          450
#define SEG9COM3                      451
#define S09C3                         452
#define SEG10COM3                     453
#define S10C3                         454
#define S11C3                         455
#define SEG11COM3                     456
#define S12C3                         457
#define T3CKPS019                     458
#define SEG12COM3                     459
#define S13C3                         460
#define SEG13COM3                     461
#define T3CKPS119                     462
#define S14C3                         463
#define SEG14COM3                     464
#define TMR3CS019                     465
#define SEG15COM3                     466
#define S15C3                         467
#define TMR3CS119                     468
#define LCDDATA20                     469
#define S16C3                         470
#define SEG16COM3                     471
#define SEG17COM3                     472
#define S17C3                         473
#define SEG18COM3                     474
#define S18C3                         475
#define S19C3                         476
#define SEG19COM3                     477
#define S20C3                         478
#define SEG20COM3                     479
#define SEG21COM3                     480
#define S21C3                         481
#define SEG22COM3                     482
#define S22C3                         483
#define S23C3                         484
#define SEG23COM3                     485
#define S24C3                         486
#define LCDDATA21                     487
#define SEG24COM3                     488
#define S25C3                         489
#define SEG25COM3                     490
#define S26C3                         491
#define SEG26COM3                     492
#define SEG27COM3                     493
#define S27C3                         494
#define SEG28COM3                     495
#define S28C3                         496
#define SEG29COM3                     497
#define S29C3                         498
#define SEG30COM3                     499
#define S30C3                         500
#define SEG31COM3                     501
#define S31C3                         502
#define LCDDATA22                     503
#define S32C3                         504
#define SEG32COM3                     505
#define SEG33COM3                     506
#define S33C3                         507
#define S34C3                         508
#define SEG34COM3                     509
#define S35C3                         510
#define SEG35COM3                     511
#define S36C3                         512
#define SEG36COM3                     513
#define SEG37COM3                     514
#define S37C3                         515
#define S38C3                         516
#define SEG38COM3                     517
#define SEG39COM3                     518
#define S39C3                         519
#define LCDDATA23                     520
#define S40C3                         521
