tiborsimon/embedded-tdd-headers/pic/pic18/pic18f87j90_tdd.h
#define CKSEL0                        1649
#define CKSEL1                        1650
#define MODE13                        1651
#define BIAS0                         1652
#define BIAS                          1653
#define BIAS1                         1654
#define BIAS2                         1655
#define CPEN                          1656
#define OSCCON                        1657
#define SCS0                          1658
#define SCS                           1659
#define SCS1                          1660
#define IOFS                          1661
#define OSTS                          1662
#define IRCF                          1663
#define IRCF0                         1664
#define IRCF1                         1665
#define IRCF2                         1666
#define IDLEN                         1667
#define T0CON                         1668
#define T0PS                          1669
#define T0PS0                         1670
#define T0PS1                         1671
#define T0PS2                         1672
#define PSA                           1673
#define T0SE                          1674
#define T0CS                          1675
#define T08BIT                        1676
#define TMR0ON                        1677
#define TMR0L                         1678
#define TMR0H                         1679
#define STATUS                        1680
#define C                             1681
#define CARRY                         1682
#define DC                            1683
#define ZERO                          1684
#define Z                             1685
#define OV                            1686
#define OVERFLOW                      1687
#define N                             1688
#define NEGATIVE                      1689
#define FSR2L                         1690
#define PLUSW2                        1691
#define PREINC2                       1692
#define POSTDEC2                      1693
#define POSTINC2                      1694
#define INDF2                         1695
#define FSR1L                         1696
#define PLUSW1                        1697
#define PREINC1                       1698
#define POSTDEC1                      1699
#define POSTINC1                      1700
#define INDF1                         1701
#define WREG                          1702
#define FSR0L                         1703
#define PLUSW0                        1704
#define PREINC0                       1705
#define POSTDEC0                      1706
#define POSTINC0                      1707
#define INDF0                         1708
#define INTCON3                       1709
#define INT1IF                        1710
#define INT1F                         1711
#define INT2IF                        1712
#define INT2F                         1713
#define INT3F                         1714
#define INT3IF                        1715
#define INT1E                         1716
#define INT1IE                        1717
#define INT2IE                        1718
#define INT2E                         1719
#define INT3E                         1720
#define INT3IE                        1721
#define INT1P                         1722
#define INT1IP                        1723
#define INT2IP                        1724
#define INT2P                         1725
#define INTCON2                       1726
#define RBIP                          1727
#define INT3IP                        1728
#define INT3P                         1729
#define TMR0IP                        1730
#define T0IP                          1731
#define INTEDG3                       1732
#define INTEDG2                       1733
#define INTEDG1                       1734
#define INTEDG0                       1735
#define RBPU                          1736
#define NOT_RBPU                      1737
#define nRBPU                         1738
#define INTCON                        1739
#define RBIF                          1740
#define INT0F                         1741
#define INT0IF                        1742
#define T0IF                          1743
#define TMR0IF                        1744
#define RBIE                          1745
#define INT0E                         1746
#define INT0IE                        1747
#define T0IE                          1748
#define TMR0IE                        1749
#define PEIE                          1750
#define PEIE_GIEL                     1751
#define GIEL                          1752
#define GIE_GIEH                      1753
#define GIE                           1754
#define GIEH                          1755
#define PRODL                         1756
#define PRODH                         1757
#define TABLAT                        1758
#define TBLPTRL                       1759
#define TBLPTRH                       1760
#define PCL                           1761
#define PCLATH                        1762
#define PCH                           1763
#define SP0                           1764
#define STKPTR                        1765
#define STKPTR0                       1766
#define SP1                           1767
#define STKPTR1                       1768
#define STKPTR2                       1769
#define SP2                           1770
#define SP3                           1771
#define STKPTR3                       1772
#define STKPTR4                       1773
#define SP4                           1774
#define STKUNF                        1775
#define STKOVF                        1776
#define STKFUL                        1777
#define TOSL                          1778
#define TOSH                          1779

#endif // _PIC18F87J90_H_
